Page({
  data: {
    changelogList: [
      {
        version: "2.0.0",
        date: "2025-05-05",
        content: [
          "设计风格焕新升级，更有沉浸感",
          "待办支持添加详细时间点（小时、分钟）",
          "添加新手教程",
          "首页添加所在地天气显示",
          "“+”按钮上方新增语音识别按钮，添加待办更方便",
          "日历组件全新升级，支持更丰富的动效和视觉效果",
          "“日历”页代办卡片支持滑动、点击、修改完成状态",
          "修复“日历”页待办项循环加载的问题",
          "“统计”页支持一键生成报告，可选分享好友或保存本地",
          "“更多”页新增“鸣谢”页面，感谢为本小程序开发做出过贡献的人们",
          "“更多”页新增“支持与推广”页面",
          "“更多”页新增“今天吃什么”小应用，解决你的选择困难症",
          "修复已知问题"
        ]
      },
      {
        version: "1.4.2",
        date: "2025-04-25",
        content: [
          "“更多”-“数据管理”页生成数据包后支持一键转发，可发给自己/朋友",
          "美化“公告”页",
          "美化“更新日志”页",
          "修复已知问题"
        ]
      },
      {
        version: "1.4.1",
        date: "2025-04-20",
        content: [
          "新增公告栏",
          "优化界面交互体验",
          "“日历”页支持查看当天待办（基础框架已支持，后续将加入更多功能）",
          "修复已知问题"
        ]
      },
      {
        version: "1.4.0",
        date: "2025-04-13",
        content: [
          "小程序组件框架全面焕新升级，使用TDesign组件",
          "优化首页设计语言与操作逻辑，待办卡片左滑唤出菜单",
          "首页“+”支持拖动",
          "首页卡片左滑、详情页支持分享待办给好友",
          "待办添加、编辑页面组件升级，可在日历视图选择日期，面对日期不再迷茫",
          "“日历”页支持查看日历视图，显示当天待办数据，一目了然",
          "“更多”页优化操作逻辑",
          "修复了一些已知BUG"
        ]
      },
      {
        version: "1.3.0",
        date: "2025-04-06",
        content: [
          "新增“更多”板块，支持数据导入、导出等功能",
          "新增“日历”板块，后续功能有待完善",
          "解决待办详情页标题过长导致溢出页面的问题",
          "“统计”板块新增“位置分布”、“地点分布图”数据，更直观",
          "待办详情页支持长按复制信息",
          "修复了一些已知BUG"
        ]
      },
      {
        version: "1.2.1",
        date: "2025-04-05",
        content: [
          "待办支持添加位置信息，同时支持一键导航",
          "将“截止时间”改为“日期”"
        ]
      },
      {
        version: "1.2.0",
        date: "2025-04-05",
        content: [
          "支持更丰富的附加数据",
          "优化待办卡片设计",
          "添加完成时待办卡片的颜色渐变效果",
          "点击待办卡片支持查看待办详情",
          "待办详情页支持修改待办"
        ]
      },
      {
        version: "1.1.0",
        date: "2025-04-04",
        content: [
          "新增tabbar导航栏",
          "新增统计页面",
          "更换小程序名称、图标"
        ]
      },
      {
        version: "1.0.0",
        date: "2025-04-03",
        content: [
          "去除“（体验版）”标识"
        ]
      }
    ]
  },

  onShareAppMessage() {
    return {
      title: '时光绿径待办-更新日志',
      path: '/pages/changelog/changelog',
      imageUrl: 'https://pic1.imgdb.cn/item/6814180958cb8da5c8d64852.png'
    }
  },

  onShareTimeline() {
    return {
      title: '时光绿径待办-更新日志',
      path: '/pages/changelog/changelog',
      imageUrl: 'https://pic1.imgdb.cn/item/6814180958cb8da5c8d64852.png'
    }
  },
})